#include <iostream>
#include <string>

// ============================================================
// Задание 1: Замена ':' на ';', подсчёт замен
// ============================================================

void task1() {
    std::cout << "========================================\n";
    std::cout << "  Задание 1: Замена ':' на ';'\n";
    std::cout << "========================================\n";

    std::string s;
    std::cout << "Введите строку: ";
    std::getline(std::cin, s);

    int count = 0;
    for (char& c : s) {
        if (c == ':') {
            c = ';';
            count++;
        }
    }

    std::cout << "Результат:       " << s << "\n";
    std::cout << "Количество замен: " << count << "\n\n";
}

// ============================================================
// Задание 2: Замена ПОСЛЕДНЕГО вхождения S1 на S2 в строке S
// ============================================================

void task2() {
    std::cout << "========================================\n";
    std::cout << "  Задание 2: Замена последнего S1 на S2\n";
    std::cout << "========================================\n";

    std::string S, S1, S2;
    std::cout << "Введите строку S:  ";
    std::getline(std::cin, S);
    std::cout << "Введите строку S1: ";
    std::getline(std::cin, S1);
    std::cout << "Введите строку S2: ";
    std::getline(std::cin, S2);

    // rfind — поиск с конца строки
    size_t pos = S.rfind(S1);

    if (pos == std::string::npos) {
        std::cout << "Строка S1 не найдена в S.\n\n";
    } else {
        S.replace(pos, S1.size(), S2);
        std::cout << "Результат: " << S << "\n\n";
    }
}

// ============================================================
// Задание 3: Замена повторных вхождений первой буквы слова на '.'
//
//   Строка из слов, написанных ЗАГЛАВНЫМИ РУССКИМИ буквами,
//   разделённых одним или несколькими пробелами.
//   Пробелы между словами не трогаем.
//   Пример: "МИНИМУМ МАМА" → "МИНИ.У. .А.А"
// ============================================================

// Обрабатывает одно слово в UTF-8 (русские буквы — 2 байта в UTF-8)
std::string processWord(const std::string& word) {
    if (word.empty()) return word;

    std::string result = word;

    // Первая буква — 2 байта (UTF-8 кириллица)
    // Проверяем, что первый байт — начало 2-байтовой последовательности
    if ((unsigned char)word[0] < 0xC0) {
        // Однобайтовый символ (латиница или цифра) — не трогаем
        return result;
    }

    // Сохраняем первую букву (2 байта)
    char b1 = word[0];
    char b2 = word[1];

    // Начинаем проверку со второй буквы (позиция 2)
    for (size_t i = 2; i + 1 < result.size(); i += 2) {
        // Убеждаемся, что это 2-байтовый символ UTF-8
        if ((unsigned char)result[i] >= 0xC0) {
            if (result[i] == b1 && result[i + 1] == b2) {
                // Заменяем 2-байтовый символ на '.' + пустой байт-заглушка
                // Удобнее заменить пару байт на '.', сдвинув строку
                result.erase(i, 2);
                result.insert(i, 1, '.');
                // Следующий символ начинается с i+1
                i--; // компенсируем i+=2
            }
        }
    }
    return result;
}

void task3() {
    std::cout << "========================================\n";
    std::cout << "  Задание 3: Замена повторов первой буквы\n";
    std::cout << "========================================\n";

    std::string line;
    std::cout << "Введите строку (заглавные русские слова): ";
    std::getline(std::cin, line);

    std::string result;
    size_t i = 0;

    while (i < line.size()) {
        // Копируем пробелы без изменений
        if (line[i] == ' ') {
            result += ' ';
            i++;
            continue;
        }

        // Читаем слово (до пробела или конца строки)
        size_t wordStart = i;
        while (i < line.size() && line[i] != ' ') {
            i++;
        }
        std::string word = line.substr(wordStart, i - wordStart);

        // Обрабатываем слово и добавляем к результату
        result += processWord(word);
    }

    std::cout << "Исходная строка: " << line   << "\n";
    std::cout << "Результат:       " << result << "\n\n";
}

// ============================================================
int main() {
    task1();
    task2();
    task3();
    return 0;
}